<!DOCTYPE html>

<html lang="de">

<head>
	<title>Tactical Math Returns</title>
	<meta charset="UTF-8" />
	<meta name="viewport" content="width=device-width, initial-scale=1" />
	<link rel="icon" type="images/logo" href="images/TMR_Logo.png" sizes="200x200">
	<link rel="canonical" href="https://tacticalmath.games/features" />
	<link rel="stylesheet" href="assets/css/main.css" />
	<noscript><link rel="stylesheet" href="assets/css/noscript.css" /></noscript>
</head>

<body class="is-preload">

	<header id="header">
		<a href="index.html" class="title">Tactical Math Returns</a>
		<nav>
			<ul>
				<li><a href="index.html">Home</a></li>
			</ul>
		</nav>
	</header>

	<div id="wrapper">
		<section id="main" class="wrapper">
			<div class="inner">
				<h1 class="major">Features</h1>
				<span class="image fit"><img src="images/screenshots/6.jpg" alt="" /></span>
				<p>Unser Spiel weist noch mehr tolle Features auf...</p>
				<p>Wenn du mitarbeiten möchtest, dann sieh dir unser <a href="https://github.com/DaRealRoyal" target="_blank" rel="noopener">GitHub</a> an. Dort findest du unseren TacticalLauncher, unsere TacticalFont und die TacticalWebsite.</p>
				<p>Aus Lizenzgründen können wir den Code unseres Spiels dort nich veröffentlichen, trotzdem kannst du gerne ein Issue eröffnen.</p>
				<h1>Beschreibung Tactical Math Returns</h1><br><h3>Windows (Launcher):</h3><br>F&#252;r Windows, haben wir einen Launcher mit WPF geschrieben, der das Spiel aktuell h&#228;lt, denn bei einem Multiplayer-Spiel ist es wichtig, dass alle Spiele auf der aktuellen Version sind. Der Launcher l&#228;dt eine Text-Dateien von Google Drive, mit der er erkennt, ob es eine neue Version gibt, die er dann herunterl&#228;dt.<br>Damit der Launcher selbst auch installiert und aktualisiert werden kann, verwenden wir Squirrel.Windows (<a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;Squirrel&#x2F;Squirrel&#x2e;Windows" rel="noreferrer noopener">https:&#x2F;&#x2F;github.com&#x2F;Squirrel&#x2F;Squirrel.Windows</a>). Leider wird Squirrel.Windows aktuell nicht weiterentwickelt.<br>Es wurde auch &#252;berlegt, Chocolatey zu verwenden, das war aber zu kompliziert (NuGet Server Hosten f&#252;r eigenes Repo), also gibt es jetzt einen Launcher.<br>(Wir arbeiten aktuell daran, noch weitere Spiele, wie den Space Flight Simulator von Jannes, im Launcher zur Verf&#252;gung zu stellen und den Launcher um einige Funktionen zu erweitern.)<br><br><h3>Linux (Flatpak):</h3><br>Um auch eine Linux Version des Spiels bereitzustellen, haben wir uns f&#252;r Flatpak entschieden. Flatpak ist einfach zu nutzen, mit Integration in verschiedenen Software Centern und funktioniert auf jeder Distribution ohne gro&#223;e Probleme. Bei einigen Distributionen wie z.B. Fedora, CentOS, Elementary OS, Linux Mint und Pop! OS ist es bereits vorinstalliert. Ein weiterer Vorteil von Flatpak ist, dass Flatpak-Anwendungen in einer Sandbox-Umgebung isoliert vom Rest des Systems laufen und nur die Berechtigungen haben, die sie auch brauchen. Somit sind sie sicherer und es gibt keine Probleme mit Konflikten zwischen Anwendungen.<br><br><h3>Android (Play Store):</h3><br>F&#252;r Android ist der Google Play Store die Plattform der Wahl. Wir verteilen so intern &#252;ber den Play Store die aktuellste Version. Wenn sie fertig ist, soll sie auch f&#252;r alle verf&#252;gbar sein.<br><br><h3>Das Spiel selbst:</h3><br>Laufen kann man mit WASD. Mit der linken Maustaste kann B&#228;ume&#x2F;Setzlinge pflanzen.&nbsp;<br>Mit der ESC Taste pausiert man das Spiel. Hier findet man eine &#220;bersicht, bei der man ins Men&#252; oder die Karte wechseln kann. Dabei wird eine Abstimmung gestartet, ob die Mehrheit der Spieler die Kart wechseln will.<br>Es befinden sich 50 Setzlinge in der Hand. Diese kann man verpflanzen, oder auf den Gegner werfen, danach muss man mit R neue B&#228;ume aus dem Rucksack holen. Trifft man den Gegner, dann ist er f&#252;r 1 Sekunde Handlungsunf&#228;hig. Im Pausemen&#252; kann man sehen, wie viele B&#228;ume man bereits gepflanzt hat.<br><br><ul class="bullet"><li>verschiedene Karten (Bismarck-Gymnasium, Among Us The Skeld, Test, Level 1, Zumthor, RandomMap)</ul><br><br><h3>Multiplayer:</h3><br>F&#252;r den Multiplayer verwenden wir Mirror (<a href="https&#x3a;&#x2F;&#x2F;mirror&#x2d;networking&#x2e;com&#x2F;" rel="noreferrer noopener">https:&#x2F;&#x2F;mirror-networking.com&#x2F;</a>), eine High Level Networking Library f&#252;r Unity. Mirror ist eine Weiterentwicklung basiert auf Unity&#x27;s eingestelltem UNET Networking System. Durch Mirror, ist das schreiben von Multiplayer Code schnell und einfach, da Server und Client ein Unity Projekt sind, allerdings hat man dadurch auch weniger Flexibilit&#228;t beim Server.<br><br><h3>Cheats:</h3><br>Pflanzen, &quot;neue B&#228;ume holen&quot; etc. wird Serverseitig ausgef&#252;hrt, dadurch kann man dabei nicht einfach cheaten. Allerdings wird bei der Bewegung dem Spieler vertraut, wodurch man trotzdem sehr leicht cheaten kann.<br>Wir haben auch schon im Spiel eingebaute Cheats.&nbsp;<br><br><h3>Server hosten:</h3><br>Im lokalen Netzwerk kann man sich ohne Probleme mit einem lokalen Host mit Hilfe dessen lokalen IP-Adresse verbinden.<br>Wenn man einen Server hosten will und &#252;ber das Internet darauf zugreifen will, muss eine Portfreigabe f&#252;r Port 7777 eingerichtet werden (Protokoll: KCP [kann leider auf einer Fritz!Box nicht einfach freigegeben werden]). Dann kann man seine IP-Adresse, wenn man sie nicht wei&#223;, &#252;ber ipinfo.io nachschauen. Mit dieser kann man sich nun &#252;ber das Internet mit dem Server verbinden, indem man Sie ins Feld &quot;Server Adress&quot; im Hauptmen&#252; des Spiels eintr&#228;gt.<br><br><h3>Tactical Font:</h3><br>Was braucht jedes gute Spiel? Eindeutig eine eigene Schriftart!<br><a href="https&#x3a;&#x2F;&#x2F;github&#x2e;com&#x2F;DaRealRoyal&#x2F;TacticalFont" rel="noreferrer noopener">https:&#x2F;&#x2F;github.com&#x2F;DaRealRoyal&#x2F;TacticalFont</a><br><br><br><h2><u>Neue Features Halbjahr</u></h2><br>- verbesserte Maps<br>- Random Map Generator<br>- verbesserte Steuerung<br>- neues UI<br>- Bessere Skalierung des UI f&#252;r unterschiedliche Displays<br>- Performanceverbesserungen<br>- neue Maps: &quot;NASA&quot;, &quot;Zumthor&quot;, &quot;Level 1&quot;<br>- 3D Audio<br>- Schleichen, Sprinten<br>- verbesserter Multiplayer<br><ul class="indent"><li>- Spieler haben unterschiedlicher Farben</li><li>- Namen &#252;ber Spielern</li><li>- Spielerliste im Pausemen&#252;</li><li>- Server</li><li>- Abstimmung zum Wechseln der Map</li><li>- B&#228;ume verschwinden nicht mehr, wenn man sich trennt und erneut verbindet</li><li>- Backend Verbesserungen</ul>- &quot;Debug Console&quot;<br>- Launcher<br>- Flatpak<br>- neue Webseite<br>- Touch UI<br>und mehr (wird vielleicht noch erg&#228;nzt)<br><br><h3><u>Nachtr&#228;gliche Gedanken</u></h3><br>Wir h&#228;tten Unity 2019 LTS verwenden sollen, statt 2020.1, denn wir verwenden keinen neuen Features von 2020 und 2019 LTS wird l&#228;nger unterst&#252;zt und ist stabiler. Unity 2020 LTS ist noch nicht mit Mirror kompatibel.<br>Au&#223;erdem h&#228;tten wir die Universal Render Pipeline von Unity verwenden k&#246;nnen, da sie besser und moderner ist.<br>Mit standardisierten Commitnachrichten h&#228;tte man Changelogs und das Journal, ohne zus&#228;tzlichen Aufwand, automatisch generieren k&#246;nnen.&nbsp;<br><br>
		</section>
	</div>

	<footer id="footer" class="wrapper alt">
		<div class="inner">
			<ul class="menu">
				<li>&copy; Alle Rechte vorbehalten, DRR 2021.</li>
				<li>Design: <a href="http://html5up.net">HTML5 UP</a></li>
			</ul>
		</div>
	</footer>

	<script src="assets/js/jquery.min.js"></script>
	<script src="assets/js/jquery.scrollex.min.js"></script>
	<script src="assets/js/jquery.scrolly.min.js"></script>
	<script src="assets/js/browser.min.js"></script>
	<script src="assets/js/breakpoints.min.js"></script>
	<script src="assets/js/util.js"></script>
	<script src="assets/js/main.js"></script>
</body>

</html>
